[{"instructions":["Sprinkle the avocado with vinegar to prevent browning while you work.","Place a bamboo sushi mat on a flat work surface with the slats running horizontally. Lay a piece of plastic wrap over the bamboo mat. Place a sheet of nori on the plastic wrap, shiny side down.","With wet hands, spread about 3/4 cup of the rice over the surface of the nori, leaving about a 1/2-inch uncovered on the furthest edge. Press and spread the rice down firmly but gently, wetting your hands again if needed to prevent sticking.","Set the salmon pieces end-to-end across the center of the rice. Top the salmon with a few slices of avocado (it’s okay if they overlap a bit). Begin rolling the edge of the bamboo closest to you over the salmon line, using the mat to press down on the sushi roll firmly but gently. When you get to the raw edge of nori, use your finger to lightly wet the nori, then continue to roll up so it’s sealed. The nori should stick to itself when the roll is complete.","Remove the plastic wrap and set the roll aside, covering with a damp cloth while you work on the remaining rolls. Repeat until all of the rice has been used.","Cut each roll in half, and then half again, and then half again, so each roll is cut into 8 even pieces. Serve with pickled ginger, wasabi, and soy sauce."],"_id":"5de390f92160a26b4a0dd41e","picture":"SalmonAvocadoRoll.jpg","recipe":"Salmon Avocado Roll","type":"Maki","servings":"8","calories":"","time":{"prep":"25 mins","cook":"","total":"25 mins"},"ingredients":[{"name":"avocado","value":"AVOCADO","icon":"","quantity":"1 (thinly sliced)"},{"name":"nori","value":"NORI","icon":"Nori.png","quantity":"4 sheets"},{"name":"rice vinegar","value":"RICE VINEGAR","icon":"","quantity":" 1 tbsp."},{"name":"sushi rice","value":"SUSHI RICE","icon":"Rice.png","quantity":"3 cups"},{"name":"salmon","value":"SALMON","icon":"Salmon.png","quantity":"8 oz. (1/2 in. strips)"},{"name":"pickled ginger","value":"PICKLED GINGER","icon":"Ginger.png","quantity":""},{"name":"wasabi","value":"WASABI","icon":"Wasabi.png","quantity":""},{"name":"soy sauce","value":"SOY SAUCE","icon":"Soysauce.png","quantity":""}],"ingredient":{"unmeasured":["avocado","nori","rice vinegar","sushi rice","salmon","pickled ginger","wasabi","soy sauce"],"measured":{"avocado":"1 (thinly sliced)","nori":"4 sheets","rice vinegar":"1 tbsp.","sushi rice":"3 cups","salmon":"8 oz. (1/2 in. strips)","pickled ginger":"","wasabi":"","soy sauce":""}}},{"instructions":["In a bowl, cover the rice with cold water. Rinse the rice until the water becomes cloudy. Drain and repeat 4 to 5 times or until the water runs clear. Leave the rice in a strainer until thoroughly drained.","In a saucepan over high heat, bring the rice, water and salt to a boil. Cover and cook over low heat for 15 minutes or until the liquid is completely absorbed. Remove from the heat and let rest, covered, for 10 minutes.","Meanwhile, in a small saucepan over medium-low heat, gently warm the vinegar and sugar until the sugar has dissolved.","Spread the cooked rice onto a baking sheet and pour the vinegar mixture overtop. Gently combine to coat and separate the grains of rice. Spread out the rice again and cover with plastic wrap. Let cool slightly.","With a sharp knife, trim and discard the discoloured sections of the salmon. While holding the knife at 30°, finely slice the fish against the grain to obtain slices 4 inches (10 cm) long (see note). Set aside on a cold plate or refrigerate while shaping the rice balls.","With slightly moistened hands, shape the rice into 2 1/2-inch (6 cm) oblong balls using 2 tbsp of rice for each. Spread a small amount of wasabi onto each rice ball, to taste, and cover with a salmon slice (see note).","Serve with the soy sauce and pickled ginger."],"_id":"5defdfdd1c9d440000643406","picture":"SalmonNigiri.jpg","recipe":"Salmon Nigiri","type":"Nigiri","servings":"24","calories":"50","time":{"prep":"50 mins","cook":"15 mins","total":"1 hour 15 mins"},"ingredients":[{"name":"sushi rice","value":"SUSHI RICE","icon":"","quantity":"1 1/2 cups"},{"name":"water","value":"WATER","icon":"","quantity":"1 3/4 cups"},{"name":"salt","value":"SALT","icon":"","quantity":"1 tsp."},{"name":"rice vinegar","value":"RICE VINEGAR","icon":"","quantity":"3 tbsp."},{"name":"sugar","value":"SUGAR","icon":"","quantity":"1 tbsp."},{"name":"salmon","value":"SALMON","icon":"","quantity":"1 lb. (sushi grade)"},{"name":"wasabi","value":"WASABI","icon":"","quantity":""},{"name":"soy sauce","value":"SOY SAUCE","icon":"","quantity":""},{"name":"pickled ginger","value":"PICKLED GINGER","icon":"","quantity":""}],"ingredient":{"unmeasured":["sushi rice","water","salt","rice vinegar","sugar","salmon","wasabi","soy sauce","pickled ginger"],"measured":{"sushi rice":"1 1/2 cups","water":"1 3/4 cups","salt":"1 tsp.","rice vinegar":"3 tbsp.","sugar":"1 tbsp.","salmon":"1 lb. (sushi grade)","wasabi":"1 tsp.","soy sauce":"","pickled ginger":""}}},{"instructions":["In a small bowl, mix the mayonnaise, gochujang and fish sauce until thoroughly combined.","On a sushi mat lay down the nori. Spread the sushi rice over the nori in an even layer. Place the salmon horizontally over the bottom third of the sheet, about 1 inch from the edge. Top with some scallions. Roll up tightly and cut into 4 pieces. Garnish with the spicy mayo."],"_id":"5defe1f91c9d440000643407","picture":"SpicySalmonRoll.jpg","recipe":"Spicy Salmon Roll","type":"Maki","servings":"1","calories":"","time":{"prep":"15 mins","cook":"","total":"15 mins"},"ingredient":{"unmeasured":["mayonnaise","gochujang","fish sauce","nori","sushi rice","salmon","scallions"],"measured":{"mayonnaise oil":"1/4 cup","gochujang":"2 tbsp.","fish sauce":"1 tsp.","nori":"1 sheet","sushi rice":"1 cup","salmon":"3 thin slices (sushi grade)","scallions":"(julienned)"}},"ingredients":[{"name":"mayonnaise","value":"MAYONNAISE","icon":"Mayo.png","quantity":"1/4 cup"},{"name":"gochujang","value":"GOCHUJANG","icon":"","quantity":"2 tbsp."},{"name":"fish sauce","value":"FISHSAUCE","icon":"","quantity":"1 tsp."},{"name":"nori","value":"NORI","icon":"Nori.png","quantity":"1 sheet"},{"name":"sushi rice","value":"SUSHIRICE","icon":"Rice.png","quantity":"1 cup"},{"name":"salmon","value":"SALMON","icon":"Salmon.png","quantity":"3 thin slices (sushi grade)"},{"name":"scallions","value":"SCALLIONS","icon":"Greenonion.png","quantity":""}]},{"instructions":["Finely chop 3 crab sticks (surimi). Put the chopped sticks in a mixing bowl. Add masago roe and 2 or 3 tablespoons of mayonnaise. Mix the ingredients using a wooden spoon or spatula. Make sure the sea food is adequately coated with mayonnaise. Cover and refrigerate until needed."," The prawns are cooked ‘sous vide’ (French for ‘under vacuum’). This is a method of cooking in which the food is vacuum sealed in an airtight plastic bag and cooked in water at a constant, relatively low temperature. This is a great way to cook the food evenly, ensuring that the inside is properly cooked and retains moisture, without overcooking the outside. As a result the food tastes even better and gets a better structure.","To make sure the temperature stays the same, it’s best to use a dedicated sous vide cooker. Cooking sous vide by hand is not really an option. Unles you’re willing to sit next to the stove while continously measuring the water temperature and adjusting the heat accordingly.","If you don’t have a sous vide cooker, you can cook the prawns in the traditional manner. But I think it’s worth the purchase. Sous vide cooking is the difference between good and really great tastes!","Preheat the sous vide cooker to 58º Celsius/ 136º Fahrenheit.","Put 5 or 6 large prawns in a plastic sous vide cooking bag. Remove the air from the bag using a table-top vacuum sealer and seal the bag. Gently lower the bag into the sous vide cooker, then cook for 10 to 12 minutes.","Remove the cooking bag from the sous vide cooker using a pair of metal tongs. Cut the bag open and gently take out the prawns. Let them cool for five minutes.","Next, remove the head from each prawn by simply snapping it back, away from the body. Also remove the scales and tail. Cut a little excess from both ends of the prawn with a knife, creating a straight edge at each end.","Hold the prawn between your thumb and forefinger, then use the tip of your blade to make a vertical incision along the length of the prawn. Take care not to cut all the way through the flesh. You should hear a pop once the blade hits the inner cavity. Remove the black intestinal tract using your fingers or a pair of tweezers.","Make sure to clean the cutting board with hot water each time you use it to prepare a new variety of fish or seafood.","Put the salmon on the cutting board and make a 45 degree, diagonal cut across the salmon filet, starting at the center. Position the knife at the same 45 degrees angle and make 0,5 cm thick slices.","Position your knife at a twenty to thirty degree angle at one end of the yellowtail filet. Make slices of 0.5 cm thick by dragging the heel of the knife through the flesh in one single fluid motion. Do the same with the yellowfin filet.","Put a bamboo rolling mat inside a a zip-lock bag. Place a single sheet of nori shiny-side down on the rolling mat. Moisten the tips of your fingers with a little water and put the cooked white sushi rice onto the sheet.","Spread the rice evenly over the entire nori sheet with your fingers. ‘Fluff’the rice while you’re spreading it.","Flip the nori sheet over and add the filling. Start with the crab mix. Use a fork to create a thick line of crab mix along the length of the nori sheet closest to you. For ease of rolling, leave approximately half an inch of space open from the edge of the sheet. Put two strips of cucumber above the crab mix line.","Raise the near edge of the rolling mat with your thumbs, while holding the cucumber in place with your index fingers. Roll the mat over the contents. Pause a few times to firm up the roll by applying pressure along the length of the mat. Roll the mat a bit further and again firm up the roll. Then unroll the mat and set the sushi roll aside.","Layer the slices of fish across the length of the roll. Alternate with avocado slice. Start with a slice of yellowtail and work your way to the center. Add a piece of prawn. Repeat the sequence of fish until you come to the end of the roll.","Cover the entire sushi roll with clingfilm. Use the rolling mat to press the clingfilm against the sushi roll, packing the contents tightly together.","For a neater finish, remove the clingfilm and cut of both sides of the roll with the tip of your knife. Cover the roll once more with clingfilm, and again use the mat to firm up the contents.","Hold your knife under the cold tap for a few seconds. This prevent rice from sticking to the blade. Cut the roll. Start with the heel of your knife and gently cut through the roll in one fluid motion.","To create slices of equal size, cut the sushi roll in half, then into quarters, and then into eighths. You may need to moisten the blade again if it begins to drag.","The Rainbow sushi roll is quite an elaborate creation.Therefore it deserves a little extra effort when it comes to the presentation. Serve the sushi on a traditional wooden sushi presentation board. This leaves you plenty of space for the slices and a decorative side garnish.","For this sushi roll, Chef Devaux suggests creating a backdrop of fanned cucumber and carrot spirals in the near corner. Neatly arrange your slices in a diagonal fashion on the board. Finish with a ramekin of soy sauce in front of the slices, along with a teaspoon of freshly grated wasabi."],"_id":"5df133f21c9d44000043e009","picture":"RainbowRoll.jpg","recipe":"Rainbow Roll","type":"Maki","servings":"","calories":"","time":{"prep":"","cook":"","total":""},"ingredients":[{"name":"kani","value":"KANI","icon":"","quantity":"3 sticks"},{"name":"masago","value":"MASAGO","icon":"","quantity":"3 tbsp."},{"name":"prawns","value":"PRAWNS","icon":"","quantity":"6 (large)"},{"name":"yellowtail","value":"YELLOWTAIL","icon":"Yellowtail.png","quantity":"1 filet (sushi grade)"},{"name":"ahi tuna","value":"TUNA","icon":"Tuna.png","quantity":"1 filet (sushi grade)"},{"name":"salmon","value":"SALMON","icon":"Salmon.png","quantity":"1 filet (sushi grade)"},{"name":"nori","value":"NORI","icon":"Nori.png","quantity":"1 sheet"},{"name":"sushi rice","value":"RICE","icon":"Rice.png","quantity":"1 cup"},{"name":"cucumber","value":"CUCUMBER","icon":"Cucumber.png","quantity":"1 (cut into 1cm wide strips)"},{"name":"avocado","value":"AVOCADO","icon":"Avocado.png","quantity":"1"},{"name":"soy sauce","value":"SOYSAUCE","icon":"Soysauce.png","quantity":""},{"name":"wasabi","value":"WASABI","icon":"Wasabi.png","quantity":""}],"ingredient":{"unmeasured":["kani","masago","prawns","yellowtail","ahi tuna","salmon","nori","sushi rice","cucumber","avocado","soy sauce","wasabi"]}},{"instructions":["Peel the cucumber and slice it with vegetable slicer","Line the sushi roll on the kitchen board and place cling film on top of it.","Place the cucumber slices vertically in a way, that each slice overlaps the other.","Slice your avocado and place it horizontally on a cucumber slices, same as making sushi rolls.","Add slices of salmon","Roll it the same way like sushi rolls and at the end gently press it and wrap with the cling film to hold the shape together.","Place it in the freezer for 10-15 minutes","Once cooled, gently remove cling film and with a sharp knife cut the slices.","You can add whatever you desire and can serve it with wasabi, caviar etc"],"_id":"5df1427d1c9d4400008063cd","picture":"NarutoRoll.jpg","recipe":"Naruto Roll","type":"Maki","servings":"3","calories":"","time":{"prep":"40 mins","cook":"","total":"40 mins"},"ingredients":[{"name":"cucumber","value":"CUCUMBER","icon":"Cucumber.png","quantity":"1 (long)"},{"name":"avocado","value":"AVOCADO","icon":"Avocado.png","quantity":"1/2"},{"name":"salmon","value":"SALMON","icon":"Salmon.png","quantity":"3 slices (sushi grade)"}],"ingredient":{"unmeasured":["cucumber","avocado","salmon"]}}]